{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "name": "Untitled21.ipynb",
      "provenance": [],
      "collapsed_sections": [],
      "include_colab_link": true
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "metadata": {
        "id": "view-in-github",
        "colab_type": "text"
      },
      "source": [
        "<a href=\"https://colab.research.google.com/github/Waxpple/COLAB_NEO4J/blob/master/Use_Neo4j_on_Colab.ipynb\" target=\"_parent\"><img src=\"https://colab.research.google.com/assets/colab-badge.svg\" alt=\"Open In Colab\"/></a>"
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "xTjbX2FzMWW4",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 221
        },
        "outputId": "208b5955-4376-4279-9b79-0a476eae9774"
      },
      "source": [
        "!pip install py2neo\n",
        "from py2neo import Graph\n",
        "#bolt://###[your-ip]:[your-port],auth=(\"user-account\",\"password\")\n",
        "graph = Graph(\"\",auth=())"
      ],
      "execution_count": 52,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "Requirement already satisfied: py2neo in /usr/local/lib/python3.6/dist-packages (4.3.0)\n",
            "Requirement already satisfied: colorama in /usr/local/lib/python3.6/dist-packages (from py2neo) (0.4.3)\n",
            "Requirement already satisfied: urllib3<1.25,>=1.23 in /usr/local/lib/python3.6/dist-packages (from py2neo) (1.24.3)\n",
            "Requirement already satisfied: pytz in /usr/local/lib/python3.6/dist-packages (from py2neo) (2018.9)\n",
            "Requirement already satisfied: click==7.0 in /usr/local/lib/python3.6/dist-packages (from py2neo) (7.0)\n",
            "Requirement already satisfied: pygments~=2.3.1 in /usr/local/lib/python3.6/dist-packages (from py2neo) (2.3.1)\n",
            "Requirement already satisfied: certifi in /usr/local/lib/python3.6/dist-packages (from py2neo) (2019.11.28)\n",
            "Requirement already satisfied: prompt-toolkit~=2.0.7 in /usr/local/lib/python3.6/dist-packages (from py2neo) (2.0.10)\n",
            "Requirement already satisfied: neobolt~=1.7.12 in /usr/local/lib/python3.6/dist-packages (from py2neo) (1.7.15)\n",
            "Requirement already satisfied: neotime~=1.7.4 in /usr/local/lib/python3.6/dist-packages (from py2neo) (1.7.4)\n",
            "Requirement already satisfied: wcwidth in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit~=2.0.7->py2neo) (0.1.7)\n",
            "Requirement already satisfied: six>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit~=2.0.7->py2neo) (1.12.0)\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "pKuqAVxdSZ8C",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 241
        },
        "outputId": "6f72cc7e-18b2-41fb-d014-915035f9f8e8"
      },
      "source": [
        "\"!pip install py2neo --upgrade"
      ],
      "execution_count": 19,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "Requirement already up-to-date: py2neo in /usr/local/lib/python3.6/dist-packages (4.3.0)\n",
            "Requirement already satisfied, skipping upgrade: pygments~=2.3.1 in /usr/local/lib/python3.6/dist-packages (from py2neo) (2.3.1)\n",
            "Requirement already satisfied, skipping upgrade: colorama in /usr/local/lib/python3.6/dist-packages (from py2neo) (0.4.3)\n",
            "Requirement already satisfied, skipping upgrade: urllib3<1.25,>=1.23 in /usr/local/lib/python3.6/dist-packages (from py2neo) (1.24.3)\n",
            "Requirement already satisfied, skipping upgrade: pytz in /usr/local/lib/python3.6/dist-packages (from py2neo) (2018.9)\n",
            "Requirement already satisfied, skipping upgrade: certifi in /usr/local/lib/python3.6/dist-packages (from py2neo) (2019.11.28)\n",
            "Requirement already satisfied, skipping upgrade: click==7.0 in /usr/local/lib/python3.6/dist-packages (from py2neo) (7.0)\n",
            "Requirement already satisfied, skipping upgrade: prompt-toolkit~=2.0.7 in /usr/local/lib/python3.6/dist-packages (from py2neo) (2.0.10)\n",
            "Requirement already satisfied, skipping upgrade: neotime~=1.7.4 in /usr/local/lib/python3.6/dist-packages (from py2neo) (1.7.4)\n",
            "Requirement already satisfied, skipping upgrade: neobolt~=1.7.12 in /usr/local/lib/python3.6/dist-packages (from py2neo) (1.7.15)\n",
            "Requirement already satisfied, skipping upgrade: wcwidth in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit~=2.0.7->py2neo) (0.1.7)\n",
            "Requirement already satisfied, skipping upgrade: six>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from prompt-toolkit~=2.0.7->py2neo) (1.12.0)\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "Q8Xbv-KqTWxF",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 34
        },
        "outputId": "58e7d75f-5692-4461-ba04-923e61c4ce72"
      },
      "source": [
        "graph.run(\"CREATE CONSTRAINT ON (c:Character) ASSERT c.name IS UNIQUE;\")\n",
        "for record in graph.run('''\n",
        "LOAD CSV WITH HEADERS FROM \"https://www.macalester.edu/~abeverid/data/stormofswords.csv\" AS row\n",
        "MERGE (src:Character {name: row.Source})\n",
        "MERGE (tgt:Character {name: row.Target})\n",
        "MERGE (src)-[r:INTERACTS]->(tgt)\n",
        "SET r.weight = toInt(row.Weight)\n",
        "RETURN count(*) AS paths_written\n",
        "'''):\n",
        "    print(record)"
      ],
      "execution_count": 34,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record paths_written=352>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "9gim83fNPpDp",
        "colab_type": "code",
        "colab": {}
      },
      "source": [
        "for record in graph.run('''\n",
        "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book1-edges.csv\" AS row\n",
        "MATCH (src:Character {name: row.Source})\n",
        "MATCH (tgt:Character {name: row.Target})\n",
        "// relationship for the book\n",
        "MERGE (src)-[r:INTERACTS1]->(tgt) ON CREATE SET r.weight = toInt(row.weight), r.book=1\n",
        "'''):\n",
        "    print(record)"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "lecPXDHDTjbR",
        "colab_type": "code",
        "colab": {}
      },
      "source": [
        "graph.run(\"CREATE CONSTRAINT ON (c:Character) ASSERT c.name IS UNIQUE;\")\n",
        "\n",
        "for record in graph.run('''\n",
        "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book2-edges.csv\" AS row\n",
        "MATCH (src:Character {name: row.Source})\n",
        "MATCH (tgt:Character {name: row.Target})\n",
        "// relationship for the book\n",
        "MERGE (src)-[r:INTERACTS2]->(tgt) ON CREATE SET r.weight = toInt(row.weight), r.book=2\n",
        "'''):\n",
        "    print(record)"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "tvLBt-HgTn1Y",
        "colab_type": "code",
        "colab": {}
      },
      "source": [
        "graph.run(\"CREATE CONSTRAINT ON (c:Character) ASSERT c.name IS UNIQUE;\")\n",
        "\n",
        "for record in graph.run('''\n",
        "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book3-edges.csv\" AS row\n",
        "MATCH (src:Character {name: row.Source})\n",
        "MATCH (tgt:Character {name: row.Target})\n",
        "// relationship for the book\n",
        "MERGE (src)-[r:INTERACTS3]->(tgt) ON CREATE SET r.weight = toInt(row.weight), r.book=3\n",
        "'''):\n",
        "    print(record)"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "qOdj4x0ETrf2",
        "colab_type": "code",
        "colab": {}
      },
      "source": [
        "graph.run(\"CREATE CONSTRAINT ON (c:Character) ASSERT c.name IS UNIQUE;\")\n",
        "\n",
        "for record in graph.run('''\n",
        "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book45-edges.csv\" AS row\n",
        "MATCH (src:Character {name: row.Source})\n",
        "MATCH (tgt:Character {name: row.Target})\n",
        "// relationship for the book\n",
        "MERGE (src)-[r:INTERACTS45]->(tgt) ON CREATE SET r.weight = toInt(row.weight), r.book=45\n",
        "'''):\n",
        "    print(record)"
      ],
      "execution_count": 0,
      "outputs": []
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "9IL36sGlTPj7",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 1000
        },
        "outputId": "d2f778ab-c835-497f-b0f8-8f361efcd05b"
      },
      "source": [
        "for r in graph.run('''\n",
        "MATCH p=(:Character)-[:INTERACTS]-(:Character)\n",
        "RETURN p\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 39,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record p=(Belwas)<-[:INTERACTS {weight: 13}]-(Jorah)>\n",
            "<Record p=(Belwas)<-[:INTERACTS {weight: 26}]-(Daenerys)>\n",
            "<Record p=(Belwas)-[:INTERACTS {weight: 10}]->(Illyrio)>\n",
            "<Record p=(Belwas)-[:INTERACTS {weight: 18}]->(Barristan)>\n",
            "<Record p=(Beric)<-[:INTERACTS {weight: 15}]-(Sandor)>\n",
            "<Record p=(Beric)<-[:INTERACTS {weight: 23}]-(Arya)>\n",
            "<Record p=(Beric)<-[:INTERACTS {weight: 8}]-(Eddard)>\n",
            "<Record p=(Beric)-[:INTERACTS {weight: 21}]->(Thoros)>\n",
            "<Record p=(Beric)-[:INTERACTS {weight: 4}]->(Gendry)>\n",
            "<Record p=(Beric)-[:INTERACTS {weight: 4}]->(Anguy)>\n",
            "<Record p=(Bran)<-[:INTERACTS {weight: 10}]-(Sansa)>\n",
            "<Record p=(Bran)<-[:INTERACTS {weight: 9}]-(Arya)>\n",
            "<Record p=(Bran)<-[:INTERACTS {weight: 23}]-(Robb)>\n",
            "<Record p=(Bran)<-[:INTERACTS {weight: 15}]-(Eddard)>\n",
            "<Record p=(Bran)<-[:INTERACTS {weight: 4}]-(Catelyn)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 11}]->(Samwell)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 11}]->(Theon)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 14}]->(Nan)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 35}]->(Rickon)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 54}]->(Meera)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 4}]->(Luwin)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 12}]->(Jon)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 46}]->(Jojen)>\n",
            "<Record p=(Bran)-[:INTERACTS {weight: 96}]->(Hodor)>\n",
            "<Record p=(Brienne)<-[:INTERACTS {weight: 5}]-(Sansa)>\n",
            "<Record p=(Brienne)<-[:INTERACTS {weight: 4}]-(Roose)>\n",
            "<Record p=(Brienne)<-[:INTERACTS {weight: 6}]-(Robb)>\n",
            "<Record p=(Brienne)<-[:INTERACTS {weight: 88}]-(Jaime)>\n",
            "<Record p=(Brienne)<-[:INTERACTS {weight: 5}]-(Cersei)>\n",
            "<Record p=(Brienne)<-[:INTERACTS {weight: 7}]-(Catelyn)>\n",
            "<Record p=(Brienne)-[:INTERACTS {weight: 7}]->(Loras)>\n",
            "<Record p=(Bronn)<-[:INTERACTS {weight: 31}]-(Tyrion)>\n",
            "<Record p=(Bronn)<-[:INTERACTS {weight: 4}]-(Cersei)>\n",
            "<Record p=(Bronn)-[:INTERACTS {weight: 19}]->(Podrick)>\n",
            "<Record p=(Bronn)-[:INTERACTS {weight: 5}]->(Gregor)>\n",
            "<Record p=(Brynden)<-[:INTERACTS {weight: 4}]-(Tywin)>\n",
            "<Record p=(Brynden)<-[:INTERACTS {weight: 6}]-(Arya)>\n",
            "<Record p=(Brynden)<-[:INTERACTS {weight: 4}]-(Rickard)>\n",
            "<Record p=(Brynden)<-[:INTERACTS {weight: 17}]-(Robb)>\n",
            "<Record p=(Brynden)<-[:INTERACTS {weight: 7}]-(Edmure)>\n",
            "<Record p=(Brynden)<-[:INTERACTS {weight: 8}]-(Catelyn)>\n",
            "<Record p=(Brynden)-[:INTERACTS {weight: 5}]->(Walder)>\n",
            "<Record p=(Brynden)-[:INTERACTS {weight: 4}]->(Lothar)>\n",
            "<Record p=(Catelyn)<-[:INTERACTS {weight: 5}]-(Eddard)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 19}]->(Walder)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 5}]->(Tyrion)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 6}]->(Roslin)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 4}]->(Roose)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 4}]->(Stannis)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 8}]->(Sansa)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 8}]->(Lysa)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 10}]->(Jeyne)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 43}]->(Robb)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 5}]->(Petyr)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 9}]->(Hoster)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 19}]->(Jaime)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 4}]->(Cersei)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 16}]->(Edmure)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 7}]->(Brienne)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 8}]->(Brynden)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 4}]->(Bran)>\n",
            "<Record p=(Cersei)<-[:INTERACTS {weight: 16}]-(Tywin)>\n",
            "<Record p=(Cersei)<-[:INTERACTS {weight: 16}]-(Sansa)>\n",
            "<Record p=(Cersei)<-[:INTERACTS {weight: 5}]-(Arya)>\n",
            "<Record p=(Cersei)<-[:INTERACTS {weight: 4}]-(Lysa)>\n",
            "<Record p=(Cersei)<-[:INTERACTS {weight: 6}]-(Eddard)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 6}]->(Sandor)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 4}]->(Shae)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 46}]->(Tyrion)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 4}]->(Varys)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 23}]->(Joffrey)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 10}]->(Meryn)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 4}]->(Pycelle)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 16}]->(Robert)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 6}]->(Gregor)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 4}]->(Elia)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 36}]->(Jaime)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 7}]->(Ilyn)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 4}]->(Bronn)>\n",
            "<Record p=(Cersei)-[:INTERACTS {weight: 5}]->(Brienne)>\n",
            "<Record p=(Cersei)<-[:INTERACTS {weight: 4}]-(Catelyn)>\n",
            "<Record p=(Craster)<-[:INTERACTS {weight: 34}]-(Samwell)>\n",
            "<Record p=(Craster)<-[:INTERACTS {weight: 11}]-(Mance)>\n",
            "<Record p=(Craster)<-[:INTERACTS {weight: 7}]-(Jon)>\n",
            "<Record p=(Craster)<-[:INTERACTS {weight: 17}]-(Gilly)>\n",
            "<Record p=(Craster)-[:INTERACTS {weight: 6}]->(Karl)>\n",
            "<Record p=(Daario)<-[:INTERACTS {weight: 7}]-(Jorah)>\n",
            "<Record p=(Daario)<-[:INTERACTS {weight: 14}]-(Daenerys)>\n",
            "<Record p=(Daario)-[:INTERACTS {weight: 4}]->(Drogo)>\n",
            "<Record p=(Daario)-[:INTERACTS {weight: 5}]->(Irri)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 14}]->(Worm)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 26}]->(Missandei)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 10}]->(Kraznys)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 47}]->(Jorah)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 17}]->(Irri)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 8}]->(Viserys)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 5}]->(Robert)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 12}]->(Rhaegar)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 7}]->(Rakharo)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 20}]->(Barristan)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 26}]->(Belwas)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 14}]->(Daario)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n",
            "<Record p=(Daenerys)-[:INTERACTS {weight: 8}]->(Aegon)>\n",
            "<Record p=(Davos)<-[:INTERACTS {weight: 5}]-(Shireen)>\n",
            "<Record p=(Davos)<-[:INTERACTS {weight: 32}]-(Stannis)>\n",
            "<Record p=(Davos)<-[:INTERACTS {weight: 30}]-(Melisandre)>\n",
            "<Record p=(Davos)-[:INTERACTS {weight: 16}]->(Salladhor)>\n",
            "<Record p=(Davos)-[:INTERACTS {weight: 4}]->(Cressen)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 8}]->(Rickon)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 13}]->(Robb)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 6}]->(Jaime)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 8}]->(Jon)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 6}]->(Sansa)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 10}]->(Robert)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 5}]->(Sandor)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 18}]->(Arya)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 6}]->(Cersei)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 5}]->(Catelyn)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 15}]->(Bran)>\n",
            "<Record p=(Eddard)-[:INTERACTS {weight: 8}]->(Beric)>\n",
            "<Record p=(Eddison)<-[:INTERACTS {weight: 12}]-(Samwell)>\n",
            "<Record p=(Eddison)<-[:INTERACTS {weight: 4}]-(Jon)>\n",
            "<Record p=(Eddison)-[:INTERACTS {weight: 8}]->(Grenn)>\n",
            "<Record p=(Edmure)<-[:INTERACTS {weight: 32}]-(Robb)>\n",
            "<Record p=(Edmure)<-[:INTERACTS {weight: 5}]-(Jaime)>\n",
            "<Record p=(Edmure)<-[:INTERACTS {weight: 9}]-(Hoster)>\n",
            "<Record p=(Edmure)-[:INTERACTS {weight: 16}]->(Roslin)>\n",
            "<Record p=(Edmure)-[:INTERACTS {weight: 9}]->(Walder)>\n",
            "<Record p=(Edmure)-[:INTERACTS {weight: 7}]->(Brynden)>\n",
            "<Record p=(Edmure)-[:INTERACTS {weight: 4}]->(Lothar)>\n",
            "<Record p=(Edmure)<-[:INTERACTS {weight: 16}]-(Catelyn)>\n",
            "<Record p=(Gendry)<-[:INTERACTS {weight: 5}]-(Sandor)>\n",
            "<Record p=(Gendry)<-[:INTERACTS {weight: 43}]-(Arya)>\n",
            "<Record p=(Gendry)-[:INTERACTS {weight: 7}]->(Thoros)>\n",
            "<Record p=(Gendry)<-[:INTERACTS {weight: 4}]-(Beric)>\n",
            "<Record p=(Gilly)<-[:INTERACTS {weight: 36}]-(Samwell)>\n",
            "<Record p=(Gilly)<-[:INTERACTS {weight: 7}]-(Mance)>\n",
            "<Record p=(Gilly)<-[:INTERACTS {weight: 9}]-(Jon)>\n",
            "<Record p=(Gilly)-[:INTERACTS {weight: 17}]->(Craster)>\n",
            "<Record p=(Gregor)<-[:INTERACTS {weight: 7}]-(Tywin)>\n",
            "<Record p=(Gregor)<-[:INTERACTS {weight: 22}]-(Tyrion)>\n",
            "<Record p=(Gregor)<-[:INTERACTS {weight: 7}]-(Arya)>\n",
            "<Record p=(Gregor)<-[:INTERACTS {weight: 5}]-(Joffrey)>\n",
            "<Record p=(Gregor)<-[:INTERACTS {weight: 6}]-(Jaime)>\n",
            "<Record p=(Gregor)-[:INTERACTS {weight: 24}]->(Oberyn)>\n",
            "<Record p=(Gregor)-[:INTERACTS {weight: 7}]->(Meryn)>\n",
            "<Record p=(Gregor)-[:INTERACTS {weight: 12}]->(Sandor)>\n",
            "<Record p=(Gregor)-[:INTERACTS {weight: 9}]->(Elia)>\n",
            "<Record p=(Gregor)-[:INTERACTS {weight: 7}]->(Ilyn)>\n",
            "<Record p=(Gregor)<-[:INTERACTS {weight: 6}]-(Cersei)>\n",
            "<Record p=(Gregor)<-[:INTERACTS {weight: 5}]-(Bronn)>\n",
            "<Record p=(Hodor)<-[:INTERACTS {weight: 5}]-(Robb)>\n",
            "<Record p=(Hodor)-[:INTERACTS {weight: 35}]->(Jojen)>\n",
            "<Record p=(Hodor)-[:INTERACTS {weight: 41}]->(Meera)>\n",
            "<Record p=(Hodor)<-[:INTERACTS {weight: 96}]-(Bran)>\n",
            "<Record p=(Hoster)<-[:INTERACTS {weight: 6}]-(Lysa)>\n",
            "<Record p=(Hoster)-[:INTERACTS {weight: 9}]->(Edmure)>\n",
            "<Record p=(Hoster)<-[:INTERACTS {weight: 9}]-(Catelyn)>\n",
            "<Record p=(Irri)<-[:INTERACTS {weight: 4}]-(Missandei)>\n",
            "<Record p=(Irri)-[:INTERACTS {weight: 7}]->(Drogo)>\n",
            "<Record p=(Irri)<-[:INTERACTS {weight: 17}]-(Daenerys)>\n",
            "<Record p=(Irri)<-[:INTERACTS {weight: 5}]-(Daario)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 10}]-(Walton)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 13}]-(Tywin)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 10}]-(Sansa)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 15}]-(Robb)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 11}]-(Arya)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 18}]-(Aerys)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 11}]->(Qyburn)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 7}]->(Renly)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 17}]->(Robert)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 5}]->(Stannis)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 8}]->(Tommen)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 31}]->(Tyrion)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 88}]->(Brienne)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 4}]->(Barristan)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 4}]->(Elia)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 5}]->(Edmure)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 15}]->(Joffrey)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 6}]->(Gregor)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 11}]->(Meryn)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 16}]->(Loras)>\n",
            "<Record p=(Jaime)-[:INTERACTS {weight: 6}]->(Balon)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 6}]-(Eddard)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 36}]-(Cersei)>\n",
            "<Record p=(Jaime)<-[:INTERACTS {weight: 19}]-(Catelyn)>\n",
            "<Record p=(Janos)<-[:INTERACTS {weight: 5}]-(Tyrion)>\n",
            "<Record p=(Janos)<-[:INTERACTS {weight: 6}]-(Samwell)>\n",
            "<Record p=(Janos)<-[:INTERACTS {weight: 8}]-(Jon)>\n",
            "<Record p=(Janos)-[:INTERACTS {weight: 4}]->(Mance)>\n",
            "<Record p=(Janos)-[:INTERACTS {weight: 9}]->(Alliser)>\n",
            "<Record p=(Janos)-[:INTERACTS {weight: 5}]->(Bowen)>\n",
            "<Record p=(Joffrey)<-[:INTERACTS {weight: 13}]-(Tywin)>\n",
            "<Record p=(Joffrey)<-[:INTERACTS {weight: 35}]-(Sansa)>\n",
            "<Record p=(Joffrey)<-[:INTERACTS {weight: 10}]-(Robb)>\n",
            "<Record p=(Joffrey)<-[:INTERACTS {weight: 6}]-(Arya)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 54}]->(Tyrion)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 10}]->(Stannis)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 9}]->(Tommen)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 4}]->(Oberyn)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 14}]->(Sandor)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 5}]->(Gregor)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 4}]->(Ilyn)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 8}]->(Kevan)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 7}]->(Loras)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 28}]->(Margaery)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 5}]->(Meryn)>\n",
            "<Record p=(Joffrey)-[:INTERACTS {weight: 5}]->(Myrcella)>\n",
            "<Record p=(Joffrey)<-[:INTERACTS {weight: 15}]-(Jaime)>\n",
            "<Record p=(Joffrey)<-[:INTERACTS {weight: 23}]-(Cersei)>\n",
            "<Record p=(Jojen)-[:INTERACTS {weight: 11}]->(Samwell)>\n",
            "<Record p=(Jojen)-[:INTERACTS {weight: 33}]->(Meera)>\n",
            "<Record p=(Jojen)<-[:INTERACTS {weight: 35}]-(Hodor)>\n",
            "<Record p=(Jojen)<-[:INTERACTS {weight: 46}]-(Bran)>\n",
            "<Record p=(Jon)<-[:INTERACTS {weight: 4}]-(Sansa)>\n",
            "<Record p=(Jon)<-[:INTERACTS {weight: 14}]-(Robb)>\n",
            "<Record p=(Jon)<-[:INTERACTS {weight: 7}]-(Arya)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 9}]->(Stannis)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 52}]->(Samwell)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 5}]->(Robert)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 20}]->(Rattleshirt)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 31}]->(Qhorin)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 6}]->(Orell)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 7}]->(Melisandre)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 4}]->(Meera)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 54}]->(Ygritte)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 12}]->(Val)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 8}]->(Theon)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 16}]->(Styr)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 30}]->(Aemon)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 8}]->(Janos)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 69}]->(Mance)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 9}]->(Gilly)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 25}]->(Grenn)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 6}]->(Dalla)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 4}]->(Eddison)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 15}]->(Alliser)>\n",
            "<Record p=(Jon)-[:INTERACTS {weight: 7}]->(Craster)>\n",
            "<Record p=(Jon)<-[:INTERACTS {weight: 8}]-(Eddard)>\n",
            "<Record p=(Jon)<-[:INTERACTS {weight: 12}]-(Bran)>\n",
            "<Record p=(Jon Arryn)-[:INTERACTS {weight: 6}]->(Robert)>\n",
            "<Record p=(Jon Arryn)-[:INTERACTS {weight: 5}]->(Lysa)>\n",
            "<Record p=(Jorah)<-[:INTERACTS {weight: 5}]-(Rhaegar)>\n",
            "<Record p=(Jorah)-[:INTERACTS {weight: 7}]->(Daario)>\n",
            "<Record p=(Jorah)-[:INTERACTS {weight: 6}]->(Drogo)>\n",
            "<Record p=(Jorah)-[:INTERACTS {weight: 13}]->(Belwas)>\n",
            "<Record p=(Jorah)-[:INTERACTS {weight: 11}]->(Barristan)>\n",
            "<Record p=(Jorah)<-[:INTERACTS {weight: 47}]-(Daenerys)>\n",
            "<Record p=(Kevan)<-[:INTERACTS {weight: 11}]-(Tyrion)>\n",
            "<Record p=(Kevan)<-[:INTERACTS {weight: 14}]-(Tywin)>\n",
            "<Record p=(Kevan)<-[:INTERACTS {weight: 5}]-(Sansa)>\n",
            "<Record p=(Kevan)-[:INTERACTS {weight: 7}]->(Lancel)>\n",
            "<Record p=(Kevan)-[:INTERACTS {weight: 5}]->(Varys)>\n",
            "<Record p=(Kevan)<-[:INTERACTS {weight: 8}]-(Joffrey)>\n",
            "<Record p=(Loras)<-[:INTERACTS {weight: 6}]-(Tyrion)>\n",
            "<Record p=(Loras)<-[:INTERACTS {weight: 14}]-(Sansa)>\n",
            "<Record p=(Loras)<-[:INTERACTS {weight: 8}]-(Renly)>\n",
            "<Record p=(Loras)-[:INTERACTS {weight: 9}]->(Margaery)>\n",
            "<Record p=(Loras)-[:INTERACTS {weight: 5}]->(Olenna)>\n",
            "<Record p=(Loras)<-[:INTERACTS {weight: 7}]-(Joffrey)>\n",
            "<Record p=(Loras)<-[:INTERACTS {weight: 16}]-(Jaime)>\n",
            "<Record p=(Loras)<-[:INTERACTS {weight: 7}]-(Brienne)>\n",
            "<Record p=(Loras)<-[:INTERACTS {weight: 4}]-(Balon)>\n",
            "<Record p=(Lothar)<-[:INTERACTS {weight: 12}]-(Walder)>\n",
            "<Record p=(Lothar)<-[:INTERACTS {weight: 10}]-(Robb)>\n",
            "<Record p=(Lothar)-[:INTERACTS {weight: 4}]->(Roslin)>\n",
            "<Record p=(Lothar)<-[:INTERACTS {weight: 4}]-(Edmure)>\n",
            "<Record p=(Lothar)<-[:INTERACTS {weight: 4}]-(Brynden)>\n",
            "<Record p=(Luwin)-[:INTERACTS {weight: 4}]->(Nan)>\n",
            "<Record p=(Luwin)<-[:INTERACTS {weight: 4}]-(Bran)>\n",
            "<Record p=(Lysa)<-[:INTERACTS {weight: 28}]-(Sansa)>\n",
            "<Record p=(Lysa)-[:INTERACTS {weight: 9}]->(Robert Arryn)>\n",
            "<Record p=(Lysa)-[:INTERACTS {weight: 5}]->(Tyrion)>\n",
            "<Record p=(Lysa)-[:INTERACTS {weight: 4}]->(Tywin)>\n",
            "<Record p=(Lysa)-[:INTERACTS {weight: 4}]->(Cersei)>\n",
            "<Record p=(Lysa)-[:INTERACTS {weight: 6}]->(Hoster)>\n",
            "<Record p=(Lysa)-[:INTERACTS {weight: 10}]->(Marillion)>\n",
            "<Record p=(Lysa)-[:INTERACTS {weight: 29}]->(Petyr)>\n",
            "<Record p=(Lysa)<-[:INTERACTS {weight: 5}]-(Jon Arryn)>\n",
            "<Record p=(Lysa)<-[:INTERACTS {weight: 8}]-(Catelyn)>\n",
            "<Record p=(Mance)<-[:INTERACTS {weight: 10}]-(Samwell)>\n",
            "<Record p=(Mance)<-[:INTERACTS {weight: 5}]-(Alliser)>\n",
            "<Record p=(Mance)-[:INTERACTS {weight: 8}]->(Val)>\n",
            "<Record p=(Mance)-[:INTERACTS {weight: 7}]->(Styr)>\n",
            "<Record p=(Mance)-[:INTERACTS {weight: 12}]->(Ygritte)>\n",
            "<Record p=(Mance)-[:INTERACTS {weight: 7}]->(Gilly)>\n",
            "<Record p=(Mance)-[:INTERACTS {weight: 8}]->(Dalla)>\n",
            "<Record p=(Mance)-[:INTERACTS {weight: 9}]->(Rattleshirt)>\n",
            "<Record p=(Mance)-[:INTERACTS {weight: 10}]->(Qhorin)>\n",
            "<Record p=(Mance)-[:INTERACTS {weight: 11}]->(Craster)>\n",
            "<Record p=(Mance)<-[:INTERACTS {weight: 69}]-(Jon)>\n",
            "<Record p=(Mance)<-[:INTERACTS {weight: 4}]-(Janos)>\n",
            "<Record p=(Meera)-[:INTERACTS {weight: 7}]->(Samwell)>\n",
            "<Record p=(Meera)<-[:INTERACTS {weight: 4}]-(Jon)>\n",
            "<Record p=(Meera)<-[:INTERACTS {weight: 33}]-(Jojen)>\n",
            "<Record p=(Meera)<-[:INTERACTS {weight: 41}]-(Hodor)>\n",
            "<Record p=(Meera)<-[:INTERACTS {weight: 54}]-(Bran)>\n",
            "<Record p=(Melisandre)<-[:INTERACTS {weight: 20}]-(Stannis)>\n",
            "<Record p=(Melisandre)-[:INTERACTS {weight: 5}]->(Samwell)>\n",
            "<Record p=(Melisandre)-[:INTERACTS {weight: 30}]->(Davos)>\n",
            "<Record p=(Melisandre)<-[:INTERACTS {weight: 7}]-(Jon)>\n",
            "<Record p=(Meryn)<-[:INTERACTS {weight: 5}]-(Tyrion)>\n",
            "<Record p=(Meryn)<-[:INTERACTS {weight: 4}]-(Sandor)>\n",
            "<Record p=(Meryn)-[:INTERACTS {weight: 5}]->(Ilyn)>\n",
            "<Record p=(Meryn)<-[:INTERACTS {weight: 5}]-(Joffrey)>\n",
            "<Record p=(Meryn)<-[:INTERACTS {weight: 11}]-(Jaime)>\n",
            "<Record p=(Meryn)<-[:INTERACTS {weight: 7}]-(Gregor)>\n",
            "<Record p=(Meryn)<-[:INTERACTS {weight: 10}]-(Cersei)>\n",
            "<Record p=(Missandei)-[:INTERACTS {weight: 4}]->(Irri)>\n",
            "<Record p=(Missandei)<-[:INTERACTS {weight: 26}]-(Daenerys)>\n",
            "<Record p=(Myrcella)<-[:INTERACTS {weight: 4}]-(Sansa)>\n",
            "<Record p=(Myrcella)-[:INTERACTS {weight: 4}]->(Tyrion)>\n",
            "<Record p=(Myrcella)-[:INTERACTS {weight: 5}]->(Tommen)>\n",
            "<Record p=(Myrcella)<-[:INTERACTS {weight: 5}]-(Joffrey)>\n",
            "<Record p=(Oberyn)<-[:INTERACTS {weight: 25}]-(Tyrion)>\n",
            "<Record p=(Oberyn)<-[:INTERACTS {weight: 6}]-(Tywin)>\n",
            "<Record p=(Oberyn)<-[:INTERACTS {weight: 5}]-(Amory)>\n",
            "<Record p=(Oberyn)-[:INTERACTS {weight: 6}]->(Mace)>\n",
            "<Record p=(Oberyn)-[:INTERACTS {weight: 6}]->(Ellaria)>\n",
            "<Record p=(Oberyn)<-[:INTERACTS {weight: 4}]-(Joffrey)>\n",
            "<Record p=(Oberyn)<-[:INTERACTS {weight: 24}]-(Gregor)>\n",
            "<Record p=(Podrick)<-[:INTERACTS {weight: 28}]-(Tyrion)>\n",
            "<Record p=(Podrick)<-[:INTERACTS {weight: 5}]-(Tywin)>\n",
            "<Record p=(Podrick)<-[:INTERACTS {weight: 8}]-(Sansa)>\n",
            "<Record p=(Podrick)-[:INTERACTS {weight: 4}]->(Margaery)>\n",
            "<Record p=(Podrick)<-[:INTERACTS {weight: 19}]-(Bronn)>\n",
            "<Record p=(Rattleshirt)<-[:INTERACTS {weight: 9}]-(Ygritte)>\n",
            "<Record p=(Rattleshirt)-[:INTERACTS {weight: 6}]->(Qhorin)>\n",
            "<Record p=(Rattleshirt)<-[:INTERACTS {weight: 9}]-(Mance)>\n",
            "<Record p=(Rattleshirt)<-[:INTERACTS {weight: 20}]-(Jon)>\n",
            "<Record p=(Renly)<-[:INTERACTS {weight: 6}]-(Tyrion)>\n",
            "<Record p=(Renly)<-[:INTERACTS {weight: 4}]-(Sansa)>\n",
            "<Record p=(Renly)<-[:INTERACTS {weight: 15}]-(Stannis)>\n",
            "<Record p=(Renly)<-[:INTERACTS {weight: 4}]-(Robert)>\n",
            "<Record p=(Renly)-[:INTERACTS {weight: 8}]->(Loras)>\n",
            "<Record p=(Renly)-[:INTERACTS {weight: 7}]->(Margaery)>\n",
            "<Record p=(Renly)-[:INTERACTS {weight: 4}]->(Varys)>\n",
            "<Record p=(Renly)<-[:INTERACTS {weight: 7}]-(Jaime)>\n",
            "<Record p=(Rhaegar)<-[:INTERACTS {weight: 7}]-(Viserys)>\n",
            "<Record p=(Rhaegar)-[:INTERACTS {weight: 7}]->(Elia)>\n",
            "<Record p=(Rhaegar)-[:INTERACTS {weight: 5}]->(Jorah)>\n",
            "<Record p=(Rhaegar)-[:INTERACTS {weight: 5}]->(Barristan)>\n",
            "<Record p=(Rhaegar)-[:INTERACTS {weight: 6}]->(Robert)>\n",
            "<Record p=(Rhaegar)<-[:INTERACTS {weight: 12}]-(Daenerys)>\n",
            "<Record p=(Rickard)<-[:INTERACTS {weight: 7}]-(Robb)>\n",
            "<Record p=(Rickard)-[:INTERACTS {weight: 4}]->(Brynden)>\n",
            "<Record p=(Rickon)<-[:INTERACTS {weight: 7}]-(Sansa)>\n",
            "<Record p=(Rickon)<-[:INTERACTS {weight: 15}]-(Robb)>\n",
            "<Record p=(Rickon)<-[:INTERACTS {weight: 8}]-(Arya)>\n",
            "<Record p=(Rickon)-[:INTERACTS {weight: 8}]->(Theon)>\n",
            "<Record p=(Rickon)<-[:INTERACTS {weight: 8}]-(Eddard)>\n",
            "<Record p=(Rickon)<-[:INTERACTS {weight: 35}]-(Bran)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 12}]->(Tywin)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 26}]->(Walder)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 18}]->(Jeyne)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 15}]->(Jaime)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 5}]->(Hodor)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 32}]->(Edmure)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 5}]->(Petyr)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 10}]->(Lothar)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 14}]->(Jon)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 10}]->(Joffrey)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 4}]->(Roose)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 15}]->(Rickon)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 7}]->(Rickard)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 4}]->(Ramsay)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 12}]->(Tyrion)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 11}]->(Theon)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 4}]->(Stannis)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 15}]->(Sansa)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 15}]->(Arya)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 6}]->(Brienne)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 17}]->(Brynden)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 6}]->(Balon)>\n",
            "<Record p=(Robb)-[:INTERACTS {weight: 23}]->(Bran)>\n",
            "<Record p=(Robb)<-[:INTERACTS {weight: 13}]-(Eddard)>\n",
            "<Record p=(Robb)<-[:INTERACTS {weight: 43}]-(Catelyn)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 9}]-(Tyrion)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 11}]-(Tywin)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 5}]-(Sansa)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 6}]-(Sandor)>\n",
            "<Record p=(Robert)-[:INTERACTS {weight: 4}]->(Aemon)>\n",
            "<Record p=(Robert)-[:INTERACTS {weight: 5}]->(Barristan)>\n",
            "<Record p=(Robert)-[:INTERACTS {weight: 4}]->(Renly)>\n",
            "<Record p=(Robert)-[:INTERACTS {weight: 5}]->(Stannis)>\n",
            "<Record p=(Robert)-[:INTERACTS {weight: 4}]->(Thoros)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 6}]-(Aerys)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 6}]-(Rhaegar)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 5}]-(Jon)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 6}]-(Jon Arryn)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 17}]-(Jaime)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 10}]-(Eddard)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 5}]-(Daenerys)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 16}]-(Cersei)>\n",
            "<Record p=(Robert)<-[:INTERACTS {weight: 4}]-(Arya)>\n",
            "<Record p=(Robert Arryn)<-[:INTERACTS {weight: 6}]-(Sansa)>\n",
            "<Record p=(Robert Arryn)-[:INTERACTS {weight: 4}]->(Marillion)>\n",
            "<Record p=(Robert Arryn)<-[:INTERACTS {weight: 9}]-(Lysa)>\n",
            "<Record p=(Roose)-[:INTERACTS {weight: 4}]->(Brienne)>\n",
            "<Record p=(Roose)<-[:INTERACTS {weight: 4}]-(Robb)>\n",
            "<Record p=(Roose)<-[:INTERACTS {weight: 4}]-(Catelyn)>\n",
            "<Record p=(Roose)<-[:INTERACTS {weight: 5}]-(Arya)>\n",
            "<Record p=(Samwell)<-[:INTERACTS {weight: 13}]-(Stannis)>\n",
            "<Record p=(Samwell)-[:INTERACTS {weight: 5}]->(Qhorin)>\n",
            "<Record p=(Samwell)-[:INTERACTS {weight: 6}]->(Bowen)>\n",
            "<Record p=(Samwell)-[:INTERACTS {weight: 34}]->(Craster)>\n",
            "<Record p=(Samwell)-[:INTERACTS {weight: 12}]->(Eddison)>\n",
            "<Record p=(Samwell)-[:INTERACTS {weight: 36}]->(Gilly)>\n",
            "<Record p=(Samwell)-[:INTERACTS {weight: 43}]->(Grenn)>\n",
            "<Record p=(Samwell)-[:INTERACTS {weight: 6}]->(Janos)>\n",
            "<Record p=(Samwell)-[:INTERACTS {weight: 10}]->(Mance)>\n",
            "<Record p=(Samwell)<-[:INTERACTS {weight: 31}]-(Aemon)>\n",
            "<Record p=(Samwell)<-[:INTERACTS {weight: 7}]-(Meera)>\n",
            "<Record p=(Samwell)<-[:INTERACTS {weight: 5}]-(Melisandre)>\n",
            "<Record p=(Samwell)<-[:INTERACTS {weight: 52}]-(Jon)>\n",
            "<Record p=(Samwell)<-[:INTERACTS {weight: 11}]-(Jojen)>\n",
            "<Record p=(Samwell)<-[:INTERACTS {weight: 11}]-(Bran)>\n",
            "<Record p=(Sandor)<-[:INTERACTS {weight: 4}]-(Tyrion)>\n",
            "<Record p=(Sandor)<-[:INTERACTS {weight: 6}]-(Sansa)>\n",
            "<Record p=(Sandor)-[:INTERACTS {weight: 15}]->(Beric)>\n",
            "<Record p=(Sandor)-[:INTERACTS {weight: 4}]->(Ilyn)>\n",
            "<Record p=(Sandor)-[:INTERACTS {weight: 5}]->(Gendry)>\n",
            "<Record p=(Sandor)-[:INTERACTS {weight: 6}]->(Robert)>\n",
            "<Record p=(Sandor)-[:INTERACTS {weight: 4}]->(Meryn)>\n",
            "<Record p=(Sandor)-[:INTERACTS {weight: 10}]->(Thoros)>\n",
            "<Record p=(Sandor)<-[:INTERACTS {weight: 14}]-(Joffrey)>\n",
            "<Record p=(Sandor)<-[:INTERACTS {weight: 12}]-(Gregor)>\n",
            "<Record p=(Sandor)<-[:INTERACTS {weight: 5}]-(Eddard)>\n",
            "<Record p=(Sandor)<-[:INTERACTS {weight: 6}]-(Cersei)>\n",
            "<Record p=(Sandor)<-[:INTERACTS {weight: 46}]-(Arya)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 77}]->(Tyrion)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 8}]->(Shae)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 5}]->(Robert)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 7}]->(Rickon)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 6}]->(Sandor)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 6}]->(Robert Arryn)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 28}]->(Petyr)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 7}]->(Olenna)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 4}]->(Renly)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 8}]->(Podrick)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 36}]->(Margaery)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 28}]->(Lysa)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 4}]->(Myrcella)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 9}]->(Marillion)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 22}]->(Arya)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 5}]->(Brienne)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 10}]->(Bran)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 10}]->(Jaime)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 16}]->(Cersei)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 4}]->(Jon)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 35}]->(Joffrey)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 14}]->(Loras)>\n",
            "<Record p=(Sansa)-[:INTERACTS {weight: 5}]->(Kevan)>\n",
            "<Record p=(Sansa)<-[:INTERACTS {weight: 15}]-(Robb)>\n",
            "<Record p=(Sansa)<-[:INTERACTS {weight: 6}]-(Eddard)>\n",
            "<Record p=(Sansa)<-[:INTERACTS {weight: 8}]-(Catelyn)>\n",
            "<Record p=(Shae)<-[:INTERACTS {weight: 21}]-(Tyrion)>\n",
            "<Record p=(Shae)<-[:INTERACTS {weight: 8}]-(Sansa)>\n",
            "<Record p=(Shae)-[:INTERACTS {weight: 8}]->(Varys)>\n",
            "<Record p=(Shae)-[:INTERACTS {weight: 4}]->(Chataya)>\n",
            "<Record p=(Shae)<-[:INTERACTS {weight: 4}]-(Cersei)>\n",
            "<Record p=(Shireen)-[:INTERACTS {weight: 5}]->(Davos)>\n",
            "<Record p=(Stannis)<-[:INTERACTS {weight: 6}]-(Tyrion)>\n",
            "<Record p=(Stannis)<-[:INTERACTS {weight: 15}]-(Tywin)>\n",
            "<Record p=(Stannis)-[:INTERACTS {weight: 20}]->(Melisandre)>\n",
            "<Record p=(Stannis)-[:INTERACTS {weight: 15}]->(Renly)>\n",
            "<Record p=(Stannis)-[:INTERACTS {weight: 13}]->(Samwell)>\n",
            "<Record p=(Stannis)-[:INTERACTS {weight: 4}]->(Aemon)>\n",
            "<Record p=(Stannis)-[:INTERACTS {weight: 4}]->(Balon)>\n",
            "<Record p=(Stannis)-[:INTERACTS {weight: 32}]->(Davos)>\n",
            "<Record p=(Stannis)<-[:INTERACTS {weight: 5}]-(Robert)>\n",
            "<Record p=(Stannis)<-[:INTERACTS {weight: 4}]-(Robb)>\n",
            "<Record p=(Stannis)<-[:INTERACTS {weight: 9}]-(Jon)>\n",
            "<Record p=(Stannis)<-[:INTERACTS {weight: 10}]-(Joffrey)>\n",
            "<Record p=(Stannis)<-[:INTERACTS {weight: 5}]-(Jaime)>\n",
            "<Record p=(Stannis)<-[:INTERACTS {weight: 4}]-(Catelyn)>\n",
            "<Record p=(Tommen)<-[:INTERACTS {weight: 4}]-(Tywin)>\n",
            "<Record p=(Tommen)-[:INTERACTS {weight: 5}]->(Margaery)>\n",
            "<Record p=(Tommen)<-[:INTERACTS {weight: 5}]-(Myrcella)>\n",
            "<Record p=(Tommen)<-[:INTERACTS {weight: 9}]-(Joffrey)>\n",
            "<Record p=(Tommen)<-[:INTERACTS {weight: 8}]-(Jaime)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 4}]-(Viserys)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 18}]->(Varys)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 6}]->(Stannis)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 21}]->(Shae)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 4}]->(Sandor)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 9}]->(Robert)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 6}]->(Renly)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 11}]->(Pycelle)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 28}]->(Podrick)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 12}]->(Petyr)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 25}]->(Oberyn)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 5}]->(Meryn)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 7}]->(Margaery)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 9}]->(Mace)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 6}]->(Loras)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 11}]->(Kevan)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 5}]->(Janos)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 39}]-(Tywin)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 77}]-(Sansa)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 5}]->(Elia)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 4}]->(Ellaria)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 22}]->(Gregor)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 5}]->(Ilyn)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 4}]->(Balon)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 31}]->(Bronn)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 5}]->(Chataya)>\n",
            "<Record p=(Tyrion)-[:INTERACTS {weight: 5}]->(Doran)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 12}]-(Robb)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 5}]-(Aerys)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 4}]-(Myrcella)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 5}]-(Lysa)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 54}]-(Joffrey)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 31}]-(Jaime)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 46}]-(Cersei)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 5}]-(Catelyn)>\n",
            "<Record p=(Tyrion)<-[:INTERACTS {weight: 5}]-(Arya)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 6}]->(Varys)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 4}]->(Val)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 4}]->(Walder)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 4}]->(Tommen)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 39}]->(Tyrion)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 11}]->(Robert)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 15}]->(Stannis)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 5}]->(Podrick)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 5}]->(Pycelle)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 6}]->(Oberyn)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 4}]->(Petyr)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 14}]->(Kevan)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 5}]->(Mace)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 13}]->(Jaime)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 13}]->(Joffrey)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 16}]->(Cersei)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 7}]->(Gregor)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 5}]->(Balon)>\n",
            "<Record p=(Tywin)-[:INTERACTS {weight: 4}]->(Brynden)>\n",
            "<Record p=(Tywin)<-[:INTERACTS {weight: 12}]-(Robb)>\n",
            "<Record p=(Tywin)<-[:INTERACTS {weight: 8}]-(Aerys)>\n",
            "<Record p=(Tywin)<-[:INTERACTS {weight: 4}]-(Lysa)>\n",
            "<Record p=(Val)<-[:INTERACTS {weight: 4}]-(Tywin)>\n",
            "<Record p=(Val)-[:INTERACTS {weight: 7}]->(Dalla)>\n",
            "<Record p=(Val)<-[:INTERACTS {weight: 8}]-(Mance)>\n",
            "<Record p=(Val)<-[:INTERACTS {weight: 12}]-(Jon)>\n",
            "<Record p=(Varys)<-[:INTERACTS {weight: 6}]-(Tywin)>\n",
            "<Record p=(Varys)-[:INTERACTS {weight: 4}]->(Pycelle)>\n",
            "<Record p=(Varys)<-[:INTERACTS {weight: 18}]-(Tyrion)>\n",
            "<Record p=(Varys)<-[:INTERACTS {weight: 8}]-(Shae)>\n",
            "<Record p=(Varys)<-[:INTERACTS {weight: 4}]-(Renly)>\n",
            "<Record p=(Varys)<-[:INTERACTS {weight: 5}]-(Kevan)>\n",
            "<Record p=(Varys)<-[:INTERACTS {weight: 4}]-(Cersei)>\n",
            "<Record p=(Viserys)-[:INTERACTS {weight: 7}]->(Rhaegar)>\n",
            "<Record p=(Viserys)-[:INTERACTS {weight: 4}]->(Tyrion)>\n",
            "<Record p=(Viserys)<-[:INTERACTS {weight: 8}]-(Daenerys)>\n",
            "<Record p=(Walder)-[:INTERACTS {weight: 6}]->(Roslin)>\n",
            "<Record p=(Walder)-[:INTERACTS {weight: 6}]->(Petyr)>\n",
            "<Record p=(Walder)<-[:INTERACTS {weight: 4}]-(Tywin)>\n",
            "<Record p=(Walder)-[:INTERACTS {weight: 12}]->(Lothar)>\n",
            "<Record p=(Walder)<-[:INTERACTS {weight: 26}]-(Robb)>\n",
            "<Record p=(Walder)<-[:INTERACTS {weight: 9}]-(Edmure)>\n",
            "<Record p=(Walder)<-[:INTERACTS {weight: 19}]-(Catelyn)>\n",
            "<Record p=(Walder)<-[:INTERACTS {weight: 5}]-(Brynden)>\n",
            "<Record p=(Walton)-[:INTERACTS {weight: 10}]->(Jaime)>\n",
            "<Record p=(Ygritte)-[:INTERACTS {weight: 7}]->(Qhorin)>\n",
            "<Record p=(Ygritte)-[:INTERACTS {weight: 9}]->(Rattleshirt)>\n",
            "<Record p=(Ygritte)<-[:INTERACTS {weight: 12}]-(Mance)>\n",
            "<Record p=(Ygritte)<-[:INTERACTS {weight: 54}]-(Jon)>\n",
            "<Record p=(Grenn)<-[:INTERACTS {weight: 43}]-(Samwell)>\n",
            "<Record p=(Grenn)<-[:INTERACTS {weight: 5}]-(Aemon)>\n",
            "<Record p=(Grenn)<-[:INTERACTS {weight: 25}]-(Jon)>\n",
            "<Record p=(Grenn)<-[:INTERACTS {weight: 8}]-(Eddison)>\n",
            "<Record p=(Anguy)<-[:INTERACTS {weight: 11}]-(Arya)>\n",
            "<Record p=(Anguy)<-[:INTERACTS {weight: 4}]-(Beric)>\n",
            "<Record p=(Thoros)<-[:INTERACTS {weight: 10}]-(Sandor)>\n",
            "<Record p=(Thoros)<-[:INTERACTS {weight: 4}]-(Robert)>\n",
            "<Record p=(Thoros)<-[:INTERACTS {weight: 7}]-(Gendry)>\n",
            "<Record p=(Thoros)<-[:INTERACTS {weight: 21}]-(Beric)>\n",
            "<Record p=(Thoros)<-[:INTERACTS {weight: 18}]-(Arya)>\n",
            "<Record p=(Barristan)<-[:INTERACTS {weight: 5}]-(Robert)>\n",
            "<Record p=(Barristan)<-[:INTERACTS {weight: 5}]-(Rhaegar)>\n",
            "<Record p=(Barristan)<-[:INTERACTS {weight: 11}]-(Jorah)>\n",
            "<Record p=(Barristan)<-[:INTERACTS {weight: 4}]-(Jaime)>\n",
            "<Record p=(Barristan)<-[:INTERACTS {weight: 20}]-(Daenerys)>\n",
            "<Record p=(Barristan)<-[:INTERACTS {weight: 18}]-(Belwas)>\n",
            "<Record p=(Illyrio)<-[:INTERACTS {weight: 10}]-(Belwas)>\n",
            "<Record p=(Nan)<-[:INTERACTS {weight: 4}]-(Luwin)>\n",
            "<Record p=(Nan)<-[:INTERACTS {weight: 14}]-(Bran)>\n",
            "<Record p=(Theon)<-[:INTERACTS {weight: 11}]-(Robb)>\n",
            "<Record p=(Theon)<-[:INTERACTS {weight: 8}]-(Rickon)>\n",
            "<Record p=(Theon)<-[:INTERACTS {weight: 8}]-(Jon)>\n",
            "<Record p=(Theon)<-[:INTERACTS {weight: 11}]-(Bran)>\n",
            "<Record p=(Jeyne)<-[:INTERACTS {weight: 18}]-(Robb)>\n",
            "<Record p=(Jeyne)<-[:INTERACTS {weight: 10}]-(Catelyn)>\n",
            "<Record p=(Petyr)<-[:INTERACTS {weight: 6}]-(Walder)>\n",
            "<Record p=(Petyr)<-[:INTERACTS {weight: 12}]-(Tyrion)>\n",
            "<Record p=(Petyr)<-[:INTERACTS {weight: 4}]-(Tywin)>\n",
            "<Record p=(Petyr)<-[:INTERACTS {weight: 28}]-(Sansa)>\n",
            "<Record p=(Petyr)<-[:INTERACTS {weight: 5}]-(Robb)>\n",
            "<Record p=(Petyr)<-[:INTERACTS {weight: 29}]-(Lysa)>\n",
            "<Record p=(Petyr)<-[:INTERACTS {weight: 5}]-(Catelyn)>\n",
            "<Record p=(Roslin)<-[:INTERACTS {weight: 6}]-(Walder)>\n",
            "<Record p=(Roslin)<-[:INTERACTS {weight: 4}]-(Lothar)>\n",
            "<Record p=(Roslin)<-[:INTERACTS {weight: 16}]-(Edmure)>\n",
            "<Record p=(Roslin)<-[:INTERACTS {weight: 6}]-(Catelyn)>\n",
            "<Record p=(Elia)<-[:INTERACTS {weight: 5}]-(Tyrion)>\n",
            "<Record p=(Elia)<-[:INTERACTS {weight: 7}]-(Rhaegar)>\n",
            "<Record p=(Elia)<-[:INTERACTS {weight: 4}]-(Jaime)>\n",
            "<Record p=(Elia)<-[:INTERACTS {weight: 9}]-(Gregor)>\n",
            "<Record p=(Elia)<-[:INTERACTS {weight: 4}]-(Cersei)>\n",
            "<Record p=(Ilyn)<-[:INTERACTS {weight: 5}]-(Tyrion)>\n",
            "<Record p=(Ilyn)<-[:INTERACTS {weight: 4}]-(Sandor)>\n",
            "<Record p=(Ilyn)<-[:INTERACTS {weight: 5}]-(Meryn)>\n",
            "<Record p=(Ilyn)<-[:INTERACTS {weight: 4}]-(Joffrey)>\n",
            "<Record p=(Ilyn)<-[:INTERACTS {weight: 7}]-(Gregor)>\n",
            "<Record p=(Ilyn)<-[:INTERACTS {weight: 7}]-(Cersei)>\n",
            "<Record p=(Pycelle)<-[:INTERACTS {weight: 4}]-(Varys)>\n",
            "<Record p=(Pycelle)<-[:INTERACTS {weight: 11}]-(Tyrion)>\n",
            "<Record p=(Pycelle)<-[:INTERACTS {weight: 5}]-(Tywin)>\n",
            "<Record p=(Pycelle)<-[:INTERACTS {weight: 4}]-(Cersei)>\n",
            "<Record p=(Karl)<-[:INTERACTS {weight: 6}]-(Craster)>\n",
            "<Record p=(Drogo)<-[:INTERACTS {weight: 6}]-(Jorah)>\n",
            "<Record p=(Drogo)<-[:INTERACTS {weight: 7}]-(Irri)>\n",
            "<Record p=(Drogo)<-[:INTERACTS {weight: 18}]-(Daenerys)>\n",
            "<Record p=(Drogo)<-[:INTERACTS {weight: 4}]-(Daario)>\n",
            "<Record p=(Aegon)<-[:INTERACTS {weight: 8}]-(Daenerys)>\n",
            "<Record p=(Kraznys)<-[:INTERACTS {weight: 10}]-(Daenerys)>\n",
            "<Record p=(Rakharo)<-[:INTERACTS {weight: 7}]-(Daenerys)>\n",
            "<Record p=(Worm)<-[:INTERACTS {weight: 14}]-(Daenerys)>\n",
            "<Record p=(Cressen)<-[:INTERACTS {weight: 4}]-(Davos)>\n",
            "<Record p=(Salladhor)<-[:INTERACTS {weight: 16}]-(Davos)>\n",
            "<Record p=(Qyburn)<-[:INTERACTS {weight: 11}]-(Jaime)>\n",
            "<Record p=(Bowen)<-[:INTERACTS {weight: 6}]-(Samwell)>\n",
            "<Record p=(Bowen)<-[:INTERACTS {weight: 5}]-(Janos)>\n",
            "<Record p=(Margaery)<-[:INTERACTS {weight: 7}]-(Tyrion)>\n",
            "<Record p=(Margaery)<-[:INTERACTS {weight: 36}]-(Sansa)>\n",
            "<Record p=(Margaery)<-[:INTERACTS {weight: 5}]-(Tommen)>\n",
            "<Record p=(Margaery)<-[:INTERACTS {weight: 7}]-(Renly)>\n",
            "<Record p=(Margaery)<-[:INTERACTS {weight: 4}]-(Podrick)>\n",
            "<Record p=(Margaery)<-[:INTERACTS {weight: 9}]-(Loras)>\n",
            "<Record p=(Margaery)<-[:INTERACTS {weight: 28}]-(Joffrey)>\n",
            "<Record p=(Dalla)<-[:INTERACTS {weight: 7}]-(Val)>\n",
            "<Record p=(Dalla)<-[:INTERACTS {weight: 8}]-(Mance)>\n",
            "<Record p=(Dalla)<-[:INTERACTS {weight: 6}]-(Jon)>\n",
            "<Record p=(Orell)<-[:INTERACTS {weight: 6}]-(Jon)>\n",
            "<Record p=(Qhorin)<-[:INTERACTS {weight: 7}]-(Ygritte)>\n",
            "<Record p=(Qhorin)<-[:INTERACTS {weight: 5}]-(Samwell)>\n",
            "<Record p=(Qhorin)<-[:INTERACTS {weight: 6}]-(Rattleshirt)>\n",
            "<Record p=(Qhorin)<-[:INTERACTS {weight: 10}]-(Mance)>\n",
            "<Record p=(Qhorin)<-[:INTERACTS {weight: 31}]-(Jon)>\n",
            "<Record p=(Styr)<-[:INTERACTS {weight: 7}]-(Mance)>\n",
            "<Record p=(Styr)<-[:INTERACTS {weight: 16}]-(Jon)>\n",
            "<Record p=(Lancel)<-[:INTERACTS {weight: 7}]-(Kevan)>\n",
            "<Record p=(Olenna)<-[:INTERACTS {weight: 7}]-(Sansa)>\n",
            "<Record p=(Olenna)<-[:INTERACTS {weight: 5}]-(Loras)>\n",
            "<Record p=(Marillion)<-[:INTERACTS {weight: 9}]-(Sansa)>\n",
            "<Record p=(Marillion)<-[:INTERACTS {weight: 4}]-(Robert Arryn)>\n",
            "<Record p=(Marillion)<-[:INTERACTS {weight: 10}]-(Lysa)>\n",
            "<Record p=(Ellaria)<-[:INTERACTS {weight: 4}]-(Tyrion)>\n",
            "<Record p=(Ellaria)<-[:INTERACTS {weight: 6}]-(Oberyn)>\n",
            "<Record p=(Mace)<-[:INTERACTS {weight: 9}]-(Tyrion)>\n",
            "<Record p=(Mace)<-[:INTERACTS {weight: 5}]-(Tywin)>\n",
            "<Record p=(Mace)<-[:INTERACTS {weight: 6}]-(Oberyn)>\n",
            "<Record p=(Ramsay)<-[:INTERACTS {weight: 4}]-(Robb)>\n",
            "<Record p=(Chataya)<-[:INTERACTS {weight: 4}]-(Shae)>\n",
            "<Record p=(Chataya)<-[:INTERACTS {weight: 5}]-(Tyrion)>\n",
            "<Record p=(Doran)<-[:INTERACTS {weight: 5}]-(Tyrion)>\n",
            "<Record p=(Aemon)<-[:INTERACTS {weight: 4}]-(Stannis)>\n",
            "<Record p=(Aemon)<-[:INTERACTS {weight: 4}]-(Robert)>\n",
            "<Record p=(Aemon)-[:INTERACTS {weight: 5}]->(Grenn)>\n",
            "<Record p=(Aemon)-[:INTERACTS {weight: 31}]->(Samwell)>\n",
            "<Record p=(Aemon)<-[:INTERACTS {weight: 30}]-(Jon)>\n",
            "<Record p=(Aerys)-[:INTERACTS {weight: 6}]->(Robert)>\n",
            "<Record p=(Aerys)-[:INTERACTS {weight: 5}]->(Tyrion)>\n",
            "<Record p=(Aerys)-[:INTERACTS {weight: 8}]->(Tywin)>\n",
            "<Record p=(Aerys)-[:INTERACTS {weight: 18}]->(Jaime)>\n",
            "<Record p=(Alliser)-[:INTERACTS {weight: 5}]->(Mance)>\n",
            "<Record p=(Alliser)<-[:INTERACTS {weight: 15}]-(Jon)>\n",
            "<Record p=(Alliser)<-[:INTERACTS {weight: 9}]-(Janos)>\n",
            "<Record p=(Amory)-[:INTERACTS {weight: 5}]->(Oberyn)>\n",
            "<Record p=(Arya)<-[:INTERACTS {weight: 22}]-(Sansa)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 6}]->(Joffrey)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 11}]->(Jaime)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 8}]->(Rickon)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 7}]->(Jon)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 5}]->(Cersei)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 6}]->(Brynden)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 7}]->(Gregor)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 43}]->(Gendry)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 11}]->(Anguy)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 23}]->(Beric)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 9}]->(Bran)>\n",
            "<Record p=(Arya)<-[:INTERACTS {weight: 15}]-(Robb)>\n",
            "<Record p=(Arya)<-[:INTERACTS {weight: 18}]-(Eddard)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 5}]->(Tyrion)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 18}]->(Thoros)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 46}]->(Sandor)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 5}]->(Roose)>\n",
            "<Record p=(Arya)-[:INTERACTS {weight: 4}]->(Robert)>\n",
            "<Record p=(Balon)<-[:INTERACTS {weight: 5}]-(Tywin)>\n",
            "<Record p=(Balon)<-[:INTERACTS {weight: 4}]-(Tyrion)>\n",
            "<Record p=(Balon)<-[:INTERACTS {weight: 4}]-(Stannis)>\n",
            "<Record p=(Balon)<-[:INTERACTS {weight: 6}]-(Robb)>\n",
            "<Record p=(Balon)<-[:INTERACTS {weight: 6}]-(Jaime)>\n",
            "<Record p=(Balon)-[:INTERACTS {weight: 4}]->(Loras)>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "T5nIOdRsP6c_",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 34
        },
        "outputId": "93453cc2-346e-4ef7-95de-42ace6d998e3"
      },
      "source": [
        "for record in graph.run(\"MATCH (c:Character) RETURN count(c) AS num\"):\n",
        "    print(record)"
      ],
      "execution_count": 40,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record num=107>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "bf31lSroP-YM",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 34
        },
        "outputId": "63ecfe90-8074-4a90-c3e0-21aa1011ffd6"
      },
      "source": [
        "for record in graph.run('''\n",
        "MATCH (c:Character)-[:INTERACTS]->()\n",
        "WITH c, count(*) AS num\n",
        "RETURN min(num) AS min, max(num) AS max, avg(num) AS avg_characters, stdev(num) AS stdev\n",
        "'''):\n",
        "    print(record)"
      ],
      "execution_count": 41,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record min=1 max=24 avg_characters=4.957746478873239 stdev=6.2276723918750845>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "g72-6TTNQBzU",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 85
        },
        "outputId": "e0f59842-7e73-4d1d-d520-37880a570380"
      },
      "source": [
        "for r in graph.run('''\n",
        "// Find maximum diameter of network\n",
        "// maximum shortest path between two nodes\n",
        "MATCH (a:Character), (b:Character) WHERE id(a) > id(b)\n",
        "MATCH p=shortestPath((a)-[:INTERACTS*]-(b))\n",
        "RETURN length(p) AS len, extract(x IN nodes(p) | x.name) AS path\n",
        "ORDER BY len DESC LIMIT 4\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 42,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record len=6 path=['Illyrio', 'Belwas', 'Daenerys', 'Robert', 'Sansa', 'Bran', 'Jojen']>\n",
            "<Record len=6 path=['Illyrio', 'Belwas', 'Daenerys', 'Robert', 'Sansa', 'Bran', 'Luwin']>\n",
            "<Record len=6 path=['Nan', 'Bran', 'Sansa', 'Robert', 'Daenerys', 'Belwas', 'Illyrio']>\n",
            "<Record len=6 path=['Illyrio', 'Belwas', 'Daenerys', 'Robert', 'Stannis', 'Davos', 'Shireen']>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "XyfXzr-OR76F",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 54
        },
        "outputId": "b324e916-b494-4891-96db-0008bf96e94b"
      },
      "source": [
        "for r in graph.run('''\n",
        "// Shortest path from Catelyn Stark to Khal Drogo\n",
        "MATCH (catelyn:Character {name: \"Catelyn\"}), (drogo:Character {name: \"Drogo\"})\n",
        "MATCH p=shortestPath((catelyn)-[INTERACTS*]-(drogo))\n",
        "RETURN p\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 43,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record p=(Catelyn)-[:INTERACTS {weight: 19}]->(Jaime)-[:INTERACTS {weight: 4}]->(Barristan)<-[:INTERACTS {weight: 11}]-(Jorah)-[:INTERACTS {weight: 6}]->(Drogo)>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "J-4BMK2lSBfM",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 190
        },
        "outputId": "29c94c9d-9350-420a-ec5e-f241db8bb8a8"
      },
      "source": [
        "for r in graph.run('''\n",
        "MATCH (catelyn:Character {name: \"Catelyn\"}), (drogo:Character {name: \"Drogo\"})\n",
        "MATCH p=allShortestPaths((catelyn)-[INTERACTS*]-(drogo))\n",
        "RETURN p\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 44,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record p=(Catelyn)-[:INTERACTS {weight: 8}]->(Sansa)-[:INTERACTS {weight: 5}]->(Robert)<-[:INTERACTS {weight: 5}]-(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 19}]->(Jaime)-[:INTERACTS {weight: 4}]->(Barristan)<-[:INTERACTS {weight: 11}]-(Jorah)-[:INTERACTS {weight: 6}]->(Drogo)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 19}]->(Jaime)-[:INTERACTS {weight: 4}]->(Barristan)<-[:INTERACTS {weight: 20}]-(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 19}]->(Jaime)-[:INTERACTS {weight: 17}]->(Robert)<-[:INTERACTS {weight: 5}]-(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 4}]->(Stannis)<-[:INTERACTS {weight: 5}]-(Robert)<-[:INTERACTS {weight: 5}]-(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 4}]->(Cersei)-[:INTERACTS {weight: 16}]->(Robert)<-[:INTERACTS {weight: 5}]-(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 5}]->(Tyrion)<-[:INTERACTS {weight: 4}]-(Viserys)<-[:INTERACTS {weight: 8}]-(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n",
            "<Record p=(Catelyn)-[:INTERACTS {weight: 5}]->(Tyrion)-[:INTERACTS {weight: 9}]->(Robert)<-[:INTERACTS {weight: 5}]-(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n",
            "<Record p=(Catelyn)<-[:INTERACTS {weight: 5}]-(Eddard)-[:INTERACTS {weight: 10}]->(Robert)<-[:INTERACTS {weight: 5}]-(Daenerys)-[:INTERACTS {weight: 18}]->(Drogo)>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "IFYvyF6PSUGr",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 187
        },
        "outputId": "eb14ae49-1452-4ced-b1ca-4effb9f6a748"
      },
      "source": [
        "for r in graph.run('''\n",
        "// Find all pivotal nodes in network\n",
        "MATCH (a:Character), (b:Character) WHERE id(a) > id(b)\n",
        "MATCH p=allShortestPaths((a)-[:INTERACTS*]-(b)) WITH collect(p) AS paths, a, b\n",
        "UNWIND nodes(head(paths)) as c // first path\n",
        "WITH * WHERE NOT c IN [a,b] AND all(path IN tail(paths) WHERE c IN nodes(path))\n",
        "RETURN a.name, b.name, c.name AS PivotalNode, length(head(paths)) as pathLength, length(paths) as pathCount SKIP 490 LIMIT 10\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 46,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record a.name='Aerys' b.name='Doran' PivotalNode='Tyrion' pathLength=2 pathCount=1>\n",
            "<Record a.name='Meera' b.name='Jorah' PivotalNode='Jon' pathLength=4 pathCount=3>\n",
            "<Record a.name='Meera' b.name='Jorah' PivotalNode='Robert' pathLength=4 pathCount=3>\n",
            "<Record a.name='Marillion' b.name='Bran' PivotalNode='Sansa' pathLength=2 pathCount=1>\n",
            "<Record a.name='Olenna' b.name='Mance' PivotalNode='Sansa' pathLength=3 pathCount=1>\n",
            "<Record a.name='Olenna' b.name='Mance' PivotalNode='Jon' pathLength=3 pathCount=1>\n",
            "<Record a.name='Lancel' b.name='Ygritte' PivotalNode='Kevan' pathLength=4 pathCount=1>\n",
            "<Record a.name='Lancel' b.name='Ygritte' PivotalNode='Sansa' pathLength=4 pathCount=1>\n",
            "<Record a.name='Lancel' b.name='Ygritte' PivotalNode='Jon' pathLength=4 pathCount=1>\n",
            "<Record a.name='Cressen' b.name='Bran' PivotalNode='Davos' pathLength=4 pathCount=6>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "wXnMIb0wYPXZ",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 187
        },
        "outputId": "9c445bd5-30fb-4e3c-fbba-f1ee41913507"
      },
      "source": [
        "for r in graph.run('''\n",
        "MATCH (c:Character)-[:INTERACTS]-()\n",
        "RETURN c.name AS character, count(*) AS degree ORDER BY degree DESC LIMIT 10\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 47,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record character='Tyrion' degree=36>\n",
            "<Record character='Jon' degree=26>\n",
            "<Record character='Sansa' degree=26>\n",
            "<Record character='Robb' degree=25>\n",
            "<Record character='Jaime' degree=24>\n",
            "<Record character='Tywin' degree=22>\n",
            "<Record character='Cersei' degree=20>\n",
            "<Record character='Arya' degree=19>\n",
            "<Record character='Robert' degree=18>\n",
            "<Record character='Joffrey' degree=18>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "iy6qnbQPYTma",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 187
        },
        "outputId": "6f47392a-3b60-418b-8316-a743e46ef25f"
      },
      "source": [
        "for r in graph.run('''\n",
        "MATCH (c:Character)-[r:INTERACTS]-()\n",
        "RETURN c.name AS character, sum(r.weight) AS weightedDegree ORDER BY weightedDegree DESC LIMIT 10\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 48,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record character='Tyrion' weightedDegree=551>\n",
            "<Record character='Jon' weightedDegree=442>\n",
            "<Record character='Sansa' weightedDegree=383>\n",
            "<Record character='Jaime' weightedDegree=372>\n",
            "<Record character='Bran' weightedDegree=344>\n",
            "<Record character='Robb' weightedDegree=342>\n",
            "<Record character='Samwell' weightedDegree=282>\n",
            "<Record character='Arya' weightedDegree=269>\n",
            "<Record character='Joffrey' weightedDegree=255>\n",
            "<Record character='Daenerys' weightedDegree=232>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "wXEsMFnwYWPz",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 187
        },
        "outputId": "07cde0cd-79b2-4c82-daef-83162c31e0d6"
      },
      "source": [
        "for r in graph.run('''\n",
        "MATCH (c:Character)\n",
        "WITH collect(c) AS characters\n",
        "CALL apoc.algo.betweenness(['INTERACTS'], characters, 'BOTH') YIELD node, score\n",
        "SET node.betweenness = score\n",
        "RETURN node.name AS name, score ORDER BY score DESC LIMIT 10\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 49,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record name='Jon' score=1279.7533534055324>\n",
            "<Record name='Robert' score=1165.6025171231624>\n",
            "<Record name='Tyrion' score=1101.3849724234349>\n",
            "<Record name='Daenerys' score=874.8372110508582>\n",
            "<Record name='Robb' score=706.5572832464791>\n",
            "<Record name='Sansa' score=705.1985623519137>\n",
            "<Record name='Stannis' score=571.5247305125714>\n",
            "<Record name='Jaime' score=556.1852522889822>\n",
            "<Record name='Arya' score=443.0135843004335>\n",
            "<Record name='Tywin' score=364.72121955280846>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "395YfU_aYZr8",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 187
        },
        "outputId": "32f7bb6e-ec6b-43bf-f42a-5f2a8a8c009b"
      },
      "source": [
        "for r in graph.run('''\n",
        "MATCH (c:Character)\n",
        "WITH collect(c) AS characters\n",
        "CALL apoc.algo.closeness(['INTERACTS'], characters, 'BOTH') YIELD node, score\n",
        "RETURN node.name AS name, score ORDER BY score DESC LIMIT 10\n",
        "'''):\n",
        "    print(r)"
      ],
      "execution_count": 50,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "<Record name='Tyrion' score=0.004830917874396135>\n",
            "<Record name='Sansa' score=0.004807692307692308>\n",
            "<Record name='Robert' score=0.0047169811320754715>\n",
            "<Record name='Robb' score=0.004608294930875576>\n",
            "<Record name='Arya' score=0.0045871559633027525>\n",
            "<Record name='Jon' score=0.004524886877828055>\n",
            "<Record name='Stannis' score=0.004524886877828055>\n",
            "<Record name='Jaime' score=0.004524886877828055>\n",
            "<Record name='Tywin' score=0.004424778761061947>\n",
            "<Record name='Eddard' score=0.004347826086956522>\n"
          ],
          "name": "stdout"
        }
      ]
    },
    {
      "cell_type": "code",
      "metadata": {
        "id": "QwDit_YDYeAV",
        "colab_type": "code",
        "colab": {
          "base_uri": "https://localhost:8080/",
          "height": 224
        },
        "outputId": "bad6698c-d906-4cda-882a-8dc6e518d0e7"
      },
      "source": [
        "!pip install python-igraph\n",
        "from igraph import Graph as IGraph\n",
        "\n",
        "query = '''\n",
        "MATCH (c1:Character)-[r:INTERACTS]->(c2:Character)\n",
        "RETURN c1.name, c2.name, r.weight AS weight\n",
        "'''\n",
        "\n",
        "ig = IGraph.TupleList(graph.run(query), weights=True)\n",
        "\n",
        "ig"
      ],
      "execution_count": 51,
      "outputs": [
        {
          "output_type": "stream",
          "text": [
            "Collecting python-igraph\n",
            "\u001b[?25l  Downloading https://files.pythonhosted.org/packages/0f/a0/4e7134f803737aa6eebb4e5250565ace0e2599659e22be7f7eba520ff017/python-igraph-0.7.1.post6.tar.gz (377kB)\n",
            "\r\u001b[K     |                               | 10kB 19.4MB/s eta 0:00:01\r\u001b[K     |                              | 20kB 1.8MB/s eta 0:00:01\r\u001b[K     |                             | 30kB 2.6MB/s eta 0:00:01\r\u001b[K     |                            | 40kB 1.7MB/s eta 0:00:01\r\u001b[K     |                           | 51kB 2.1MB/s eta 0:00:01\r\u001b[K     |                          | 61kB 2.5MB/s eta 0:00:01\r\u001b[K     |                          | 71kB 2.9MB/s eta 0:00:01\r\u001b[K     |                         | 81kB 2.2MB/s eta 0:00:01\r\u001b[K     |                        | 92kB 2.5MB/s eta 0:00:01\r\u001b[K     |                       | 102kB 2.8MB/s eta 0:00:01\r\u001b[K     |                      | 112kB 2.8MB/s eta 0:00:01\r\u001b[K     |                     | 122kB 2.8MB/s eta 0:00:01\r\u001b[K     |                    | 133kB 2.8MB/s eta 0:00:01\r\u001b[K     |                   | 143kB 2.8MB/s eta 0:00:01\r\u001b[K     |                   | 153kB 2.8MB/s eta 0:00:01\r\u001b[K     |                  | 163kB 2.8MB/s eta 0:00:01\r\u001b[K     |                 | 174kB 2.8MB/s eta 0:00:01\r\u001b[K     |                | 184kB 2.8MB/s eta 0:00:01\r\u001b[K     |               | 194kB 2.8MB/s eta 0:00:01\r\u001b[K     |              | 204kB 2.8MB/s eta 0:00:01\r\u001b[K     |             | 215kB 2.8MB/s eta 0:00:01\r\u001b[K     |             | 225kB 2.8MB/s eta 0:00:01\r\u001b[K     |            | 235kB 2.8MB/s eta 0:00:01\r\u001b[K     |           | 245kB 2.8MB/s eta 0:00:01\r\u001b[K     |          | 256kB 2.8MB/s eta 0:00:01\r\u001b[K     |         | 266kB 2.8MB/s eta 0:00:01\r\u001b[K     |        | 276kB 2.8MB/s eta 0:00:01\r\u001b[K     |       | 286kB 2.8MB/s eta 0:00:01\r\u001b[K     |      | 296kB 2.8MB/s eta 0:00:01\r\u001b[K     |      | 307kB 2.8MB/s eta 0:00:01\r\u001b[K     |     | 317kB 2.8MB/s eta 0:00:01\r\u001b[K     |    | 327kB 2.8MB/s eta 0:00:01\r\u001b[K     |   | 337kB 2.8MB/s eta 0:00:01\r\u001b[K     |  | 348kB 2.8MB/s eta 0:00:01\r\u001b[K     | | 358kB 2.8MB/s eta 0:00:01\r\u001b[K     || 368kB 2.8MB/s eta 0:00:01\r\u001b[K     || 378kB 2.8MB/s \n",
            "\u001b[?25hBuilding wheels for collected packages: python-igraph\n",
            "  Building wheel for python-igraph (setup.py) ... \u001b[?25l\u001b[?25hdone\n",
            "  Created wheel for python-igraph: filename=python_igraph-0.7.1.post6-cp36-cp36m-linux_x86_64.whl size=2218389 sha256=e7cbc0d340a0cd8c934f6d1dc332b99a41d4538feb1844dcd74f154e335e1642\n",
            "  Stored in directory: /root/.cache/pip/wheels/41/d6/02/34eebae97e25f5b87d60f4c0687e00523e3f244fa41bc3f4a7\n",
            "Successfully built python-igraph\n",
            "Installing collected packages: python-igraph\n",
            "Successfully installed python-igraph-0.7.1.post6\n"
          ],
          "name": "stdout"
        },
        {
          "output_type": "execute_result",
          "data": {
            "text/plain": [
              "<igraph.Graph at 0x7f3308396138>"
            ]
          },
          "metadata": {
            "tags": []
          },
          "execution_count": 51
        }
      ]
    }
  ]
}